<template>
    <div>
        <h2 v-if='$store.state.names[$route.name]'>{{$store.state.names[$route.name]}}</h2>
        <p>Дарсонвализация — метод электролечения, основанный на использовании переменного импульсного тока высокой частоты (110 кГц), высокого напряжения (20 кВ) и малой силы (0,02 мА). Действующим фактором является электрический разряд, возникающий между электродами и телом пациента. Интенсивность разряда можно изменять в пределах от «тихого» до искрового.</p>
        <p>Метод получил название по фамилии автора, французского физиолога Жака Арсена Д’Арсонваля. Он первым изучил терапевтическое воздействие высокочастотного электрического тока на наш организм и в 1891 г. предложил применять его в лечении. Прибор для проведения этого физиотерапевтического воздействия называется аппарат Дарсонваль.</p>
        <p>Применяют дарсонвализацию в основном в виде мест¬ных процедур. Импульсы тока, раздражая нервные рецепторы кожи и слизистых оболочек, способствуют расширению артериальных и венозных сосудов, увеличению проницаемости сосудистых стенок, стимуляции обменных процессов, понижению возбудимости чувствительных и двигательных нервов. Тепловой эффект выражен незна¬чительно, что объясняется малой силой и импульсным характером действующего тока.</p>
        <p>Терапевтическое влияние дарсонвализации проявляется болеутоляющим, противозудным действием, улучшением периферического кровообращения, повышением трофики тканей в месте воздействия.</p>
        <div class="card">
            <div class="card-body border-bottom">
                <h5 class="point" @click="show1=!show1">
                    <b-icon :icon="show1?'chevron-down':'chevron-right'"></b-icon>
                    Показания
                </h5>
                <ul class="list-group list-group-flush p-4" v-if='show1'>
                    <li v-for='e in indication' :key="e">{{e}}</li>
                </ul>
            </div>
            <div class="card-body border-bottom">
                <h5 class="point" @click="show2=!show2">
                    <b-icon :icon="show2?'chevron-down':'chevron-right'"></b-icon>
                    Противопоказания
                </h5>
                <ul class="list-group list-group-flush p-4" v-if='show2'>
                    <li v-for='e in contraindication' :key="e">{{e}}</li>
                </ul>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data:()=>({
        show1:false,
        show2:false,
        indication:[
            'Варикозное расширение вен голени и геморроидальных вен',
            'Болезнь Рейно 1-2 ст',
            'Отморожение',
            'Трофические язвы',
            'Длительно незаживающие раны',
            'Трещины анального отверстия',
            'Ожоги',
            'Зудящие дерматозы',
            'Выпадение волос',
            'Экзема, псориаз, нейродермит',
            'Парадонтоз, хронический гингивит, стоматит',
            'Вазомоторный ринит',
            'Неврит слухового нерва',
            'Невралгии',
            'Боли в области сердца и головные боли, которые связаны с функциональными заболеваниями нервной системы'
        ],
        contraindication:[
            'Злокачественные новообразования',
            'Доброкачественные опухоли, расположенные в месте проведения процедуры',
            'Атеросклероз',
            'Поздняя стадия гипертонической болезни',
            'Эпилепсия',
            'Тромбофлебит',
            'Кардиоаритмия',
            'Туберкулез легких',
            'Сердечно-сосудистая недостаточность',
            'Использование кардиостимулятора',
            'Беременность',
            'Кровотечения',
            'Лихорадка',
            'Индивидуальная непереносимость тока',
            'Не рекомендуется назначение дарсонвализации детям до 7 лет'
        ]
    })
}
</script>