<template>
  <div>
    <div class="row py-md-4 py-2 border-bottom" :class="i%2!=0?'flex-row-reverse':''" v-for='(e,i) in info' :key="i" :id='e.t'>
      <div class="col-lg-6 d-flex align-self-center flex-column">
        <h2>{{$store.state.names[e.t]}}</h2>
        <h5 class='my-4'>{{e.i}}</h5>
        <b-button variant="primary" class='mt-5' style='max-width:200px;'>Подробнее</b-button>
      </div>
      <div class="col-lg-6 align-self-center">
        <img :src="`/img/home/${i+1}.jpg`" width='97%'>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data:()=>({
    info:[
      {
        t:"drink",
        i:"Запой — это патологическое состояние, характеризующееся продолжительным (более суток) употреблением алкогольных напитков, сопровождающееся сильной алкогольной интоксикацией. Запойные состояния относятся к тяжелым формам алкогольной зависимости. Ведущий синдром запоя – сильное, чаще всего непреодолимое влечение к алкогольным напиткам."
      },
      {
        t:"alc",
        i:"Лечение алкогольной зависимости представляет собой сложный, многокомпонентный, многоэтапный процесс и он не заключается только в освобождении от острых проявлений болезни (тяжелое похмелье, прерывание запоя и пр.) Основными принципами лечения хронического алкоголизма являются добровольность, индивидуальный подход к каждому пациенту, комплексность и полный отказ от употребления психоактивных веществ."
      },
      {
        t:"drug",
        i:"Задача врачей нашего медицинского центра при помощи комплекса лечебных сеансов и процедур свести абстинентные симптомы к минимуму, ускорить процессы детоксикации организма, снизить эмоциональное напряжение, раздражительность. При самостоятельной попытке бросить курить острые абстинентные симптомы и неумолимая тяга закурить обычно становятся причиной срыва."
      },
      {
        t:"game",
        i:"Игромания (лудомания или гемблинг) – болезненное патологическое пристрастие к азартным играм (компьютерным играм, игровым автоматам) приводящее к социальной, профессиональной и личностной несостоятельности.Данное состояние характеризуется сильнейшей зависимостью психики от разнообразных игр с последующими эмоциональными срывами и депрессиями."
      },
      {
        t:"fiz",
        i:"Область клинической медицины, изучающая лечебные свойства физических факторов и разрабатывающая методы их применения для лечения и профилактики болезней, а также медицинской реабилитации, называется физиотерапией."
      }
    ]
  })
}
</script>